//user服务错误码
export const userErrorCode=new Set([
    1001,    //需要登录
    1002,   //非法token
    1003,   //token过期
    1004,    //您的账号在别处登录
    1006,   //注册失败
    1007,   //密码不一致
    1008,   //手机号已经被注册
    1009,   //账号或者密码错误
    1010,   //用户不存在
    1011,   //当前密码错误
    1012,   //密码更新失败
    1013,   //密码不一致
    1014,   //密码重置失败
    1015,   //更新用户信息失败
    1016,   //用户类型不能为空
    1017,   //普通用户不能填写经济机构
    1018,   //请选择经纪机构
    1019,   //用户激活失败
    1020,   //用户已经退出登录
    1021,   //您目前没有权限添加房产
    
])

export const notifyCode=new Set([
    2003,       //邮箱已经被注册
])